# RebarShapeConstraintArcLength Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintArcLength Constructor
RebarShapeConstraintArcLength Class See Also
---
Create an arc-length constraint.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarShapeConstraintArcLength(
	ElementId paramId
)
```

Visual Basic
---
```text
Public Sub New ( _
	paramId As ElementId _
)
```

Visual C++
---
```text
public:
RebarShapeConstraintArcLength(
	ElementId^ paramId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId The Id of a Rebar Shape parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | paramId is not a valid Element identifier. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShapeConstraintArcLength Class
Autodesk.Revit.DB.Structure Namespace